In [1]:
import pandas as pd

In [2]:
# Criando dicionaros a partir de chaves em uma variavel 
dados = {
    'c1': [1,1,1,2,3,3],
    'c2': ['b','b','f','h','h','h'],
    'c3': ['B','B','F','H','H','H']
}

In [3]:
# Criando DataFrame a partir do dicionario criado
tabela = pd.DataFrame(dados)
tabela

   c1 c2 c3
0   1  b  B
1   1  b  B
2   1  f  F
3   2  h  H
4   3  h  H
5   3  h  H

In [6]:
# Indentificando os registros duplicados com modelo logico
tabela.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [7]:
# Somando a quantidade de registros repetidos
tabela.duplicated().sum()

2

In [9]:
# Romovendo as linhas repetidas 
tabela2 = tabela.drop_duplicates()
tabela2

   c1 c2 c3
0   1  b  B
2   1  f  F
3   2  h  H
4   3  h  H

In [19]:
tabela.drop_duplicates(inplace=True)
tabela

   c1 c2 c3
0   1  b  B
2   1  f  F
3   2  h  H
4   3  h  H

In [25]:
# Criando um novo dataframe utilizando o numpy
import numpy as np
tabela1 = pd.DataFrame(np.arange(16).reshape(4,4))
tabela1

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
# Criando outro Dataframe
tabela_2 = pd.DataFrame(np.arange(10).reshape(2,5))
tabela_2

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [27]:
# Contatenando duas tabelas, juntando ambas em uma so
pd.concat((tabela1, tabela_2))

    0   1   2   3    4
0   0   1   2   3  NaN
1   4   5   6   7  NaN
2   8   9  10  11  NaN
3  12  13  14  15  NaN
0   0   1   2   3  4.0
1   5   6   7   8  9.0

In [29]:
# Contatenando as tabelas por colunas
pd.concat([tabela1, tabela_2], axis=1)

    0   1   2   3    0    1    2    3    4
0   0   1   2   3  0.0  1.0  2.0  3.0  4.0
1   4   5   6   7  5.0  6.0  7.0  8.0  9.0
2   8   9  10  11  NaN  NaN  NaN  NaN  NaN
3  12  13  14  15  NaN  NaN  NaN  NaN  NaN

### Exercicio

In [30]:
nan = np.nan
notas = [8,7,nan,9,7.5,10,7,nan,8]
notas = np.array(notas)
notas = notas.reshape(3,3)
notas

array([[ 8. ,  7. ,  nan],
       [ 9. ,  7.5, 10. ],
       [ 7. ,  nan,  8. ]])

In [31]:
tabelanota =pd.DataFrame(notas, index=['Thyago','Theo','sophia'], columns= ['python','java','banco de dados'])
tabelanota

        python  java  banco de dados
Thyago     8.0   7.0             NaN
Theo       9.0   7.5            10.0
sophia     7.0   NaN             8.0

In [32]:
java = tabelanota['java']
java = java.fillna(java.mean())
tabelanota['java'] = java

banco = tabelanota['banco de dados']
banco = banco.fillna(banco.mean())
tabelanota['banco de dados'] = banco
print(tabelanota)

        python  java  banco de dados
Thyago     8.0  7.00             9.0
Theo       9.0  7.50            10.0
sophia     7.0  7.25             8.0

In [34]:
notas2 = np.array([10,8.5,9,9.5,2,1.5,3.0,5.5]).reshape(2,4)
notas2

array([[10. ,  8.5,  9. ,  9.5],
       [ 2. ,  1.5,  3. ,  5.5]])

In [53]:
tabelanota2 = pd.DataFrame(notas2, index=['Fernanda','Luiz'], columns=['python','java','banco de dados','mobile'])
tabelanota2

          python  java  banco de dados  mobile
Fernanda    10.0   8.5             9.0     9.5
Luiz         2.0   1.5             3.0     5.5

In [54]:
novatabela = pd.concat([tabelanota, tabelanota2])
novatabela

          python  java  banco de dados  mobile
Thyago       8.0  7.00             9.0     NaN
Theo         9.0  7.50            10.0     NaN
sophia       7.0  7.25             8.0     NaN
Fernanda    10.0  8.50             9.0     9.5
Luiz         2.0  1.50             3.0     5.5

In [55]:
novatabela = novatabela.fillna(0)
novatabela

          python  java  banco de dados  mobile
Thyago       8.0  7.00             9.0     0.0
Theo         9.0  7.50            10.0     0.0
sophia       7.0  7.25             8.0     0.0
Fernanda    10.0  8.50             9.0     9.5
Luiz         2.0  1.50             3.0     5.5